02_Run/system/controlDict_SS
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime; //firstTime; startTime; latestTime;

startTime       0.0;

stopAt          endTime; // endTime; nextWrite; writeNow; noWriteNow

endTime         0.06; // was 0.06

deltaT          2.5e-6;

writeControl    adjustableRunTime;

writeInterval   5e-5;

purgeWrite      3;

writeFormat     ascii;

writePrecision   10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  off;

maxCo           0.5;
maxAlphaCo      1;

maxDeltaT       0.002;

functions
{
    #includeFunc  wallShearStress
    /*
    outletMassFlowFan5015Left
    {
          type            surfaceFieldValue;
          functionObjectLibs ("libfieldFunctionObjects.so");
          enabled         true;
          writeControl    timeStep;
          writeInterval   100;
          log             true;
          writeFields     false;
          regionType      patch;
          name            outletFan5015Left;
          operation       sum;
          fields
          (
              phi
          );
    }
    outletMassFlowFan5015Right
    {
          type            surfaceFieldValue;
          functionObjectLibs ("libfieldFunctionObjects.so");
          enabled         true;
          writeControl    timeStep;
          writeInterval   100;
          log             true;
          writeFields     false;
          regionType      patch;
          name            outletFan5015Right;
          operation       sum;
          fields
          (
              phi
          );
    }
    outletMassFlowFan4010
    {
          type            surfaceFieldValue;
          functionObjectLibs ("libfieldFunctionObjects.so");
          enabled         true;
          writeControl    timeStep;
          writeInterval   100;
          log             true;
          writeFields     false;
          regionType      patch;
          name            outletFan4010;
          operation       sum;
          fields
          (
              phi
          );
    }
    inletMassFlowFan5015Left
    {
          type            surfaceFieldValue;
          functionObjectLibs ("libfieldFunctionObjects.so");
          enabled         true;
          writeControl    timeStep;
          writeInterval   100;
          log             true;
          writeFields     false;
          regionType      patch;
          name            inletFan5015Left;
          operation       sum;
          fields
          (
              phi
          );
    }
    inletMassFlowFan5015Right
    {
          type            surfaceFieldValue;
          functionObjectLibs ("libfieldFunctionObjects.so");
          enabled         true;
          writeControl    timeStep;
          writeInterval   100;
          log             true;
          writeFields     false;
          regionType      patch;
          name            inletFan5015Right;
          operation       sum;
          fields
          (
              phi
          );
    }
    inletMassFlowFan4010
    {
          type            surfaceFieldValue;
          functionObjectLibs ("libfieldFunctionObjects.so");
          enabled         true;
          writeControl    timeStep;
          writeInterval   100;
          log             true;
          writeFields     false;
          regionType      patch;
          name            inletFan4010;
          operation       sum;
          fields
          (
              phi
          );
    }
    */

}

// ************************************************************************* //
