02_Run/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Uinlet (4 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

U4010           uniform (0 0 -3.6);

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

      "(inletLeft|inletRight)"
      {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
      }
      outletAtmosphere
      {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
      }
      "(walls|wallsDuctLeft|wallsDuctRight|wallsNozzle|wallsPart|wallsBuildplate)"
      {
        type                noSlip;
      }
}

// ************************************************************************* //
