02_Run/system/fvSolution_SS
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                GAMG;
        tolerance             1e-10;
        relTol                0.001;
        smoother              GaussSeidel;
        nPreSweeps            2;
        nPostSweeps           1;
        cacheAgglomeration    on;
        agglomerator          faceAreaPair;
        nCellsInCoarsestLevel 120;
        mergeLevels           1;
    }

    Phi
    {
        $p;
    }

    U
    {
        type            coupled;
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-08 1e-08 1e-08);
        relTol          (0 0 0);
        minIter         3;
    }

    k
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.0;
        nSweeps         1;
    }

    omega
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.0;
        nSweeps         1;
    }
}

SIMPLE
{
    residualControl
    {
        p               1e-6;
        U               1e-6;
        "(k|omega|e)"   1e-6;
    }
    nNonOrthogonalCorrectors 2;

    consistent no;
}

potentialFlow
{
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }

    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
